//` TODO: Global
/**
 * * Можливості у самому custom - сортування, пошук, мультивибір, згрупованність по типам елементів
 * * Опції custom - виключення елементів які вже є в списку, переключення на вибір зіскоків
 * * створити список template, створити функціонал створення, додавання, зберігання, переміщення і змінення templates 
 * * створити список saves, створити функціонал створення, переключення, зміни назви, видалення, редагування і переміщення
 * * добавити гайд(текстовий) в правому-верхньому куті або для кожного налаштування іконки-гайди
 * * Назначити або переписати архітектуру коду
 * * Добавити прикріплене меню зверху у ній мають бути - змінни мови, настройки, скарги, контактні силки
 * * Настройки - виключення ітерацій, змінна теми, різні види дизайну, включення автоматичних змін елементів при включенній опції "повтор елементів", відключення плавного переміщення елементів, можливість поставити свій фон
 */

//` TODO: Local
/**
 * * Забрати можливість любого переміщення останнього елементу якщо це зіскок
 * * Зменшими архітектуру файлів js
 * * Плавний details
 * * Переписати систему перетягування елементів(добавити можливість перетягування тільки в лівий частині)
 * * Добавити контекстне меню елементам списку
 */

//` TODO: Additional
/**
 * * Добавити кнопку "dublicate", в елементи списку
 * * Добавити в data.json елементи статики і добавити опції з статикою
 * * Обновити бібліотеку sortable
 * * Добавити коментрарі в код
 * * Добавити можливість вибору кількох елементів
 */

// // * * Виправити баг: коли включенні дві опції(перевірка, зміна зіскоку) при виборі елементів, вони потім заміняються на зіскок
// //  * * Забрати залежність опцій від увімкнення - Done
// // * * Пофіксити роботу перевірки наявності для замінни з опцією "Зіскок" - Done
// // * * Переписати prompt в deleteAllList() і changeAllList() на createTitle з інпутом  Done
// // * * замінити dateElems на json файл і брати елементи з файлу
// // * * Скачати fontAwesome і оптимізувати його під свої потреби - Done
// // * * Пофіксити некоректну роботу popup в changeAllList() - Done
// // * * Пофіксити збивання popup при багаторазовому визові - Done
// // * * Написати плавне переміщення елементів - Done
// // * * застилізувати настройки - Done
// // * * пофіксити скрол при виборі елементів на заміну - Done
// // * * перемалювати лого на темно оранжевий - Done
// // * * добавити кнопку "Select all" при активації опції "Повтор елементів" - Done
// // * * добавити перевірку наявності елементів для добавлення і замінни без повтору - Done
// // * * переписати checkRepetition() - Done
// // * * переписати createTitle - Done
// // * * запускати функції які потребую запускатись після iterate через new Promise().then() - Done