//` TODO: Global
/**
 * * Опції сhoose - виключення елементів які вже є в списку, переключення на вибір зіскоків
 * * створити список template, створити функціонал створення, додавання, зберігання, переміщення і змінення templates 
 * * добавити гайд(текстовий) в правому-верхньому куті або для кожного налаштування іконки-гайди
 * * Назначити або переписати архітектуру коду(переписати на ооп, модульна архітектура)
 * * Добавити прикріплене меню зверху у ній мають бути - змінни мови, настройки, скарги, контактні силки
 * * Настройки - виключення ітерацій, змінна теми, включення автоматичних змін елементів при включенній опції "повтор елементів", відключення плавного переміщення елементів
 * * Переписати і оптимізувати все що звязане з repeat
 */

//` TODO: Local
/**
 * * * Options choose:
 * * 1) зіскоки - done
 * * 2) унікальні елементи - 
 * *
 * * Зробити пасхалку з мінусовим значенням в settings count
 * * Пасхалка з введеням чогось в пошук
 * * Написати ще один інтерфейс
 * * Красивий інтерфейс вікна choose
 * * Змінити систему відміни popup: створювати новий popup тільки коли старий вже видалився
 * * Choose search: Виділенні елементи при пошуку не приховувати
 * * Choose search: Добавити порядок нумерації виділеним елементам
 * * Choose search: Виділенні елементи добавляти в основний пошук зразу, і з анімацією - в роздумах
 * * Choose search: добавити ліміт вибраних елементів, з урахування елементів у основному списку
 * * Покращити анімацію відкриття для вікна choose
 * * Replace name choose with manual
// // * * Choose search: якщо в групі не знайдено ні одного елементу, тоді цю групу не показувати
 * 
 */

//` TODO: Additional
/**
 * * Добавити кнопку "dublicate", в елементи списку
 * * Добавити в data.json елементи статики і добавити опції з статикою
 * * Добавити коментрарі в код
 * * Добавити можливість вибору кількох елементів
 * * Можливість поставити свій фон
 * * Плавний details
 * * Переписати систему перетягування елементів(добавити можливість перетягування тільки в лівий частині)  - in reflections
 * * CHOOSE: сортування - in reflections
 * * Добавити кнопки undo і redo:
 * * undo - відкатує список на одну дію назад
 * * redo - повертає список на одну дію вперед
 */




// // * * Добавити адаптацію для вікна choose
// // * * * CHOOSE:
// // * * 1)пошук - done
// // * * 2)мультивибір - done
// // * * 3)згрупованність по типам елементів - done
// // * * Баг: обрізання контекстного меню - done(crutch)
// // * * Баг: не працює заміна на унікальний елемент при включенній опції "повтор елементів"
// // * * Баг: за умов максимальної кількості унікальних елементів і включенній опції "повтор елементів" при виконанні change all всі елементи заміняютсья на пусті
// // * * Переписати використання функції clearAndSave - done
// // * * Добавити контекстне меню елементам списку - done
// // * * Універсалізувати функції deleteAll - done
// // * * * SAVES:
// // * * 1)створення - done
// // * * 2)переключення - done
// // * * 3)зміна назви - done
// // * * 4)видалення - done
// // * * Добавити ліміт для сейвів, добавити надпис коли немає сейвів
// //  * * Розділити css на файли
// // * * Забрати автоматичне відхилення prompt
// // * * Забрати можливість любого переміщення останнього елементу якщо це зіскок - done
// // * * Виправити баг: коли включенні дві опції(перевірка, зміна зіскоку) при виборі елементів, вони потім заміняються на зіскок
// //  * * Забрати залежність опцій від увімкнення - Done
// // * * Пофіксити роботу перевірки наявності для замінни з опцією "Зіскок" - Done
// // * * Переписати prompt в deleteAllList() і changeAllList() на createTitle з інпутом  Done
// // * * замінити dateElems на json файл і брати елементи з файлу
// // * * Скачати fontAwesome і оптимізувати його під свої потреби - Done
// // * * Пофіксити некоректну роботу popup в changeAllList() - Done
// // * * Пофіксити збивання popup при багаторазовому визові - Done
// // * * Написати плавне переміщення елементів - Done
// // * * застилізувати настройки - Done
// // * * пофіксити скрол при виборі елементів на заміну - Done
// // * * перемалювати лого на темно оранжевий - Done
// // * * добавити кнопку "Select all" при активації опції "Повтор елементів" - Done
// // * * добавити перевірку наявності елементів для добавлення і замінни без повтору - Done
// // * * переписати checkRepetition() - Done
// // * * переписати createTitle - Done
// // * * запускати функції які потребую запускатись після iterate через new Promise().then() - Done